
  // for (let i = 1; i <= 30; i++) {
  //   // Егер сан жұп болса, циклды тоқтату
  //   if (i % 2 === 0) {
  //     console.log("Цикл тоқтатылды, себебі жұп санға жетті:", i);
  //     break;
  //   }

  //   // Егер сан 3-ке және 5-ке қалдықсыз бөлінсе, оны шығару
  //   if (i % 3 === 0 && i % 5 === 0) {
  //     console.log(i);
  //   }
  // }


  // let i = 1;
  // while (i <= 30) {
  //   if (i % 2 === 0) {
  //     console.log("Цикл тоқтатылды, себебі жұп санға жетті:", i);
  //     break;
  //   }
  //   if (i % 3 === 0 && i % 5 === 0) {
  //     console.log(i);
  //   }
  //   i++;
  // }




  // for (let i = 1; i <= 30; i++) {
  //   if (i % 2 === 0) {
  //     alert("Цикл тоқтатылды, себебі жұп санға жетті: " + i);
  //     break;
  //   }
  //   if (i % 3 === 0 && i % 5 === 0) {
  //     alert(i);
  //   }
  // }


  // for (let i of Array.from({ length: 30 }, (length, index) => index + 1)) {
  //   if (i % 2 === 0) {
  //     console.log("Цикл тоқтатылды, себебі жұп санға жетті:", i);
  //     break;
  //   }
  //   if (i % 3 === 0 && i % 5 === 0) {
  //     console.log(i);
  //   }
  // }